action.no.label=Nein
action.yes.label=Ja
action.cancel.label=Abbrechen
action.assign.label=Hinzuf\u00FCgen
action.assign.hint=Neues Element hinzuf\u00FCgen.
action.view.label=Anzeigen
action.save.label=Speichern
action.submit.label=Abschicken
action.choose.label=Ausw\u00E4hlen
action.search.label=Suche
action.search.value=Schl\u00FCsselwort eingeben
action.search.hint=Suchkriterien anwenden.
action.search.erase=Suchkriterien l\u00F6schen.
action.filter.label=Filter
action.filter.hint=Suchkriterien umschalten.
action.create.label=Neu
action.create.hint=Erstellen Sie ein neues Element.
action.modify.label=Bearbeiten
action.modify.hint=Ausgew\u00E4hltes Element bearbeiten.
action.delete.label=L\u00F6schen
action.delete.hint=Ausgew\u00E4hltes Element l\u00F6schen.
action.discard.label=Verwerfen
action.discard.hint=\u00C4nderungen verwerfen.
action.refresh.label=Aktualisieren
action.refresh.hint=Aktuelle Ansicht aktualisieren.
action.revoke.label=Entfernen
action.revoke.hint=Ausgew\u00E4hltes Element entfernen.
action.signin.label=Anmelden
action.signout.label=Abmelden
action.activate.label=Aktivieren
action.deactivate.label=Deaktivieren

active.all=Alle
active.true=Actif
active.false=Inaktiv

dialog.title.confirm=Best\u00E4tigung
dialog.title.lookup=Suchen und ausw\u00E4hlen:
dialog.leave.confirm=Sie haben ungespeicherte \u00C4nderungen auf der Seite. Wenn Sie auf Ja klicken, gehen die \u00C4nderungen verloren.

error.400.code=400
error.400.text=Ung\u00FCltige Anforderung
error.400.message=Der Server kann oder wird die Anfrage aufgrund eines offensichtlichen Client-Fehlers nicht verarbeiten (z. B. fehlerhafte Anfragesyntax, zu gro\u00DFe Gr\u00F6\u00DFe, ung\u00FCltiges Anfrage-Message-Framing oder irref\u00FChrendes Anfrage-Routing).
error.401.code=401
error.401.text=Nicht Authorisiert
error.401.message=Die Anfrage enthielt g\u00FCltige Daten und wurde vom Server verstanden, aber der Server verweigert die Aktion. Dies kann darauf zur\u00FCckzuf\u00FChren sein, dass der Benutzer nicht \u00FCber die erforderlichen Berechtigungen f\u00FCr eine Ressource verf\u00FCgt oder ein Konto ben\u00F6tigt oder eine verbotene Aktion versucht. Die Anfrage sollte nicht wiederholt werden.
error.403.code=403
error.403.text=Nicht Erlaubt
error.403.message=Die Anfrage enthielt g\u00FCltige Daten und wurde vom Server verstanden, aber der Server verweigert die Aktion. Dies kann darauf zur\u00FCckzuf\u00FChren sein, dass der Benutzer nicht \u00FCber die erforderlichen Berechtigungen f\u00FCr eine Ressource verf\u00FCgt oder ein Konto ben\u00F6tigt oder eine verbotene Aktion versucht. Die Anfrage sollte nicht wiederholt werden.
error.404.code=404
error.404.text=Nicht gefunden
error.404.message=Die angeforderte Ressource konnte nicht gefunden werden, ist aber m\u00F6glicherweise in Zukunft verf\u00FCgbar. Nachforderungen des Auftraggebers sind zul\u00E4ssig.
error.405.code=405
error.405.text=Methode nicht erlaubt
error.405.message=Eine Anforderungsmethode wird f\u00FCr die angeforderte Ressource nicht unterst\u00FCtzt; z.B. eine GET-Anforderung auf einem Formular, das die Pr\u00E4sentation von Daten per POST erfordert, oder eine PUT-Anforderung auf einer schreibgesch\u00FCtzten Ressource.
error.406.code=406
error.406.text=Inakzeptabel
error.406.message=Die angeforderte Ressource ist in der Lage, nur Inhalte zu generieren, die gem\u00E4\u00DF den in der Anforderung gesendeten Accept-Headern nicht akzeptabel sind.
error.407.code=407
error.407.text=Proxy-Authentifizierung erforderlich
error.407.message=Der Client muss sich zun\u00E4chst beim Proxy authentifizieren.
error.408.code=408
error.408.text=Zeit\u00FCberschreitung der Anforderung
error.408.message=Der Client hat innerhalb der Wartezeit des Servers keine Anfrage gestellt. Der Kunde KANN die Anfrage zu einem sp\u00E4teren Zeitpunkt unver\u00E4ndert wiederholen.
error.409.code=409 - Konflikt
error.409.text=Konflikt
error.409.message=Die Anforderung konnte aufgrund eines Konflikts im aktuellen Status der Ressource nicht verarbeitet werden, z. B. aufgrund eines Bearbeitungskonflikts zwischen mehreren gleichzeitigen Aktualisierungen.
error.410.code=410
error.410.text=Gone
error.410.message=Die angeforderte Ressource ist nicht mehr verf\u00FCgbar und wird nicht wieder verf\u00FCgbar sein, der Client sollte die Ressource in Zukunft nicht mehr anfordern.
error.414.code=414
error.414.text=URI zu lang
error.414.message=Der angegebene URI war zu lang f\u00FCr die Verarbeitung durch den Server.
error.415.code=415
error.415.text=Nicht unterst\u00FCtzter Medientryp
error.415.message=Die Anforderungsentit\u00E4t hat einen Medientryp, den der Server oder die Ressource nicht unterst\u00FCtzt.
error.419.code=419
error.419.text=Sitzung abgelaufen
error.419.message=Leider ist Ihre Sitzung ist abgelaufen. Bitte aktualisieren Sie und versuchen Sie es erneut.
error.429.code=429
error.429.text=Zu viele Anfragen
error.429.message=Der Benutzer hat in einem bestimmten Zeitraum zu viele Anfragen gesendet.
error.431.code=431
error.431.text=Anfrage-Header-Felder zu gro\u00DF
error.431.message=Der Server ist nicht bereit, die Anforderung zu verarbeiten, da entweder ein einzelnes Header-Feld oder alle Header-Felder insgesamt zu gro\u00DF sind.
error.500.code=500
error.500.text=Interner Serverfehler
error.500.message=Eine allgemeine Fehlermeldung, die ausgegeben wird, wenn eine unerwartete Bedingung aufgetreten ist und keine spezifischere Nachricht geeignet ist.
error.501.code=501
error.501.text=Nicht implementiert
error.501.message=Entweder erkennt der Server die Anfragemethode nicht oder er kann die Anfrage nicht erf\u00FCllen.
error.502.code=502
error.502.text=Schlechtes Tor
error.502.message=Der Server fungierte als Gateway oder Proxy und erhielt eine ung\u00FCltige Antwort vom Upstream-Server.
error.503.code=503
error.503.text=Dienst nicht verf\u00FCgbar
error.503.message=Der Server kann die Anforderung nicht verarbeiten (weil er \u00FCberlastet oder wegen Wartungsarbeiten ausgefallen ist). Im Allgemeinen ist dies ein vor\u00FCbergehender Zustand; bitte schaue bald wieder vorbei.
error.504.code=504
error.504.text=Zeit\u00FCberschreitung Gateway
error.504.message=Der Server fungierte als Gateway oder Proxy und erhielt keine rechtzeitige Antwort vom Upstream-Server.
error.history.back=Zur\u00FCck

locale.de=Deutsch
locale.fr=Franz\u00F6sisch
locale.en=Englisch

page.forgot.password=Kennwort vergessen?
page.account.notexists=Sie haben noch kein Benutzerkonto?
page.account.register=Registrieren
page.agreement.usage=Nutzungsbedingungen
page.agreement.privacy=Datenschutzrichtlinie

signin.title=Anmeldung
signin.action.label=Anmelden
signin.instruction=Melden Sie sich bei Ihrem Benutzerkonto an.
signin.username.label=Benutzerkennung
signin.username.invalid=Bitte geben Sie eine Benutzerkennung ein!
signin.password.label=Kennwort
signin.password.invalid=Bitte geben Sie Ihr Passwort ein!
signin.access.forbidden=Sie sind nicht berechtigt, auf diese Inhalte zuzugreifen!

signout.title=Abmeldung
signout.action.label=Klicken Sie hier um sich erneut anzumelden.
signout.instruction=Sie haben sich erfolgreich abgemeldet.

status.all=Alle
status.0=Gel\u00F6scht
status.1=Aktiv
status.2=Generiert
status.4=Registeriert