action.no.label=Non
action.yes.label=Oui
action.cancel.label=Avorter
action.assign.label=Ajouter
action.assign.hint=Ajouter un nouvel \u00E9l\u00E9ment.
action.view.label=Afficher
action.save.label=Sauver
action.submit.label=Exp\u00E9dier
action.choose.label=S\u00E9lectionner
action.search.label=Chercher
action.search.value=Entrez un mot-clef
action.search.hint=Appliquer les critu00E8res de recherche.
action.search.erase=Effacer les critu00E8res de recherche.
action.filter.label=Filtre
action.filter.hint=Appliquer les critu00E8res de recherche.
action.create.label=Nouveau
action.create.hint=Cr\u00E9er un nouvel \u00E9l\u00E9ment.
action.modify.label=Modifier
action.modify.hint=Modifier l'\u00E9l\u00E9ment s\u00E9lectionn\u00E9.
action.delete.label=Effacer
action.delete.hint=Supprimer l'\u00E9l\u00E9ment s\u00E9lectionn\u00E9.
action.discard.label=Jeter
action.discard.hint=Annuler les modifications.
action.refresh.label=Rafra\u00EEchir
action.refresh.hint=Actualiser la vue actuelle.
action.revoke.label=R\u00E9voquer
action.revoke.hint=R\u00E9voquer l'\u00E9l\u00E9ment s\u00E9lectionn\u00E9.
action.signin.label=S'identifier
action.signout.label=Se d\u00E9connecter
action.activate.label=Activer
action.deactivate.label=D\u00E9sactiver

active.all=Tous
active.true=Actif
active.false=Inactif

dialog.title.confirm=Confirmation
dialog.title.lookup=Rechercher et s\u00E9lectionner:
dialog.leave.confirm=Vous avez des modifications non enregistr\u00E9es sur la page. Si vous cliquez sur Oui, les modifications seront perdues.

error.400.code=400
error.400.text=Mauvaise demande
error.400.message=Le serveur ne peut pas ou ne veut pas traiter la demande en raison d'une erreur apparente du client (par exemple, une syntaxe de demande mal form\u00E9e, une taille trop grande, un cadrage de message de demande invalide ou un routage de demande trompeur).
error.401.code=401
error.401.text=Non autoris\u00E9
error.401.message=La demande contenait des donn\u00E9es valides et a \u00E9t\u00E9 comprise par le serveur, mais le serveur refuse d'agir. Cela peut \u00EAtre d\u00FB au fait que l'utilisateur ne dispose pas des autorisations n\u00E9cessaires pour une ressource ou qu'il a besoin d'un compte quelconque, ou qu'il tente une action interdite. La demande ne doit pas \u00EAtre r\u00E9p\u00E9t\u00E9e.
error.403.code=403
error.403.text=Interdit
error.403.message=La demande contenait des donn\u00E9es valides et a \u00E9t\u00E9 comprise par le serveur, mais le serveur refuse d'agir. Cela peut \u00EAtre d\u00FB au fait que l'utilisateur ne dispose pas des autorisations n\u00E9cessaires pour une ressource ou qu'il a besoin d'un compte quelconque, ou qu'il tente une action interdite. La demande ne doit pas \u00EAtre r\u00E9p\u00E9t\u00E9e.
error.404.code=404
error.404.text=Pas trouv\u00E9
error.404.message=La ressource demand\u00E9e est introuvable mais peut \u00EAtre disponible à l'avenir. Les demandes ult\u00E9rieures du client sont autoris\u00E9es.
error.405.code=405
error.405.text=M\u00E9thode Non Autoris\u00E9e
error.405.message=Une m\u00E9thode de requ\u00EAte n'est pas prise en charge pour la ressource demand\u00E9e ; par exemple, une requ\u00EAte GET sur un formulaire qui n\u00E9cessite que les donn\u00E9es soient pr\u00E9sent\u00E9es via POST, ou une requ\u00EAte PUT sur une ressource en lecture seule.
error.406.code=406
error.406.text=Pas acceptable
error.406.message=La ressource demand\u00E9e est capable de g\u00E9n\u00E9rer uniquement du contenu non acceptable selon les en-t\u00EAtes Accept envoy\u00E9s dans la requ\u00EAte.
error.407.code=407
error.407.text=Authentification proxy requise
error.407.message=Le client doit d'abord s'authentifier aupru00E8s du proxy.
error.408.code=408
error.408.text=D\u00E9lai d'expiration de la demande
error.408.message=Le client n'a pas produit de demande dans le d\u00E9lai pendant lequel le serveur \u00E9tait pr\u00EAt \u00E0 attendre. Le client PEUT r\u00E9p\u00E9ter la demande sans modifications \u00E0 tout moment ult\u00E9rieur.
error.409.code=409
error.409.text=Conflit
error.409.message=La demande n'a pas pu \u00EAtre trait\u00E9e en raison d'un conflit dans l'\u00E9tat actuel de la ressource, tel qu'un conflit de modification entre plusieurs mises \u00E0 jour simultan\u00E9es.
error.410.code=410
error.410.text=Disparu
error.410.message=La ressource demand\u00E9e n'est plus disponible et ne sera plus disponible, le client ne doit pas demander la ressource \u00E0 l'avenir.
error.414.code=414
error.414.text=URI trop long
error.414.message=L'URI fourni \u00E9tait trop long pour \u00EAtre trait\u00E9 par le serveur.
error.415.code=415
error.415.text=Type de support non pris en charge
error.415.message=L'entit\u00E9 de demande a un type de m\u00E9dia que le serveur ou la ressource ne prend pas en charge.
error.419.code=419
error.419.text=La session a expir\u00E9e
error.419.message=D\u00E9sol\u00E9, votre session a expir\u00E9. Veuillez actualiser et r\u00E9essayer.
error.429.code=429
error.429.text=Trop de demandes
error.429.message=L'utilisateur a envoy\u00E9 trop de demandes dans un laps de temps donn\u00E9.
error.431.code=431
error.431.text=Champs d'en-t\u00EAte de demande trop volumineux
error.431.message=Le serveur ne veut pas traiter la demande car soit un champ d'en-t\u00EAte individuel, soit tous les champs d'en-t\u00EAte collectivement, sont trop volumineux.
error.500.code=500
error.500.text=Erreur interne du serveur
error.500.message=Un message d'erreur g\u00E9n\u00E9rique, donn\u00E9 lorsqu'une condition inattendue a \u00E9t\u00E9 rencontr\u00E9e et qu'aucun message plus sp\u00E9cifique ne convient.
error.501.code=501
error.501.text=Pas mis en \u0153uvre
error.501.message=Soit le serveur ne reconna\u00EEt pas la m\u00E9thode de requ\u00EAte, soit il n'a pas la capacit\u00E9 de r\u00E9pondre \u00E0 la requ\u00EAte.
error.502.code=502
error.502.text=Mauvaise passerelle
error.502.message=Le serveur agissait en tant que passerelle ou proxy et a re\u00E7u une r\u00E9ponse non valide du serveur en amont.
error.503.code=503
error.503.text=Service indisponible
error.503.message=Le serveur ne peut pas traiter la requ\u00EAte (car il est surcharg\u00E9 ou arr\u00EAt\u00E9 pour maintenance). G\u00E9n\u00E9ralement, il s'agit d'un \u00E9tat temporaire ; s'il vous pla\u00EEt revenez bient\u00F4t.
error.504.code=504
error.504.text=D\u00E9lai d'expiration de la passerelle
error.504.message=Le serveur agissait en tant que passerelle ou proxy et n'a pas reçu de r\u00E9ponse rapide du serveur en amont.
error.history.back=Arri\u00E8re

locale.de=Allemand
locale.fr=Fran\u00E7ais
locale.en=Anglais

page.forgot.password=Mot de passe oubli\u00E9?
page.account.notexists=Je n'ai pas de compte?
page.account.register=Inscrivez-vous ici
page.agreement.usage=Conditions d'utilisation
page.agreement.privacy=Politique de confidentialit\u00E9

signin.title=S'identifier
signin.action.label=S'identifier
signin.instruction=Connectez-vous \u00E0 votre compte.
signin.username.label=Nom d'utilisateur
signin.username.invalid=S'il vous pla\u00EEt entrez votre nom d'utilisateur!
signin.password.label=Mot de passe
signin.password.invalid=S'il vous plait entrez votre mot de passe!
signin.access.forbidden=Vous n'\u00EAtes pas autoris\u00E9 \u00E0 acc\u00E9der \u00E0 ce contenu !

signout.title=Se d\u00E9connecter
signout.action.label=Connectez-vous \u00E0 nouveau.
signout.instruction=Vous avez \u00E9t\u00E9 d\u00E9connect\u00E9 avec succ\u00E8s.

status.all=Tous
status.0=Supprim\u00E9t
status.1=Actif
status.2=G\u00E9n\u00E9r\u00E9
status.4=Inscrit