<?xml version="1.0" encoding="US-ASCII"?>
<!--
 |  Oracle Deutschland BV & Co. KG
 |
 |  This software is the confidential and proprietary information of
 |  Oracle Corporation. ("Confidential Information").  You shall not
 |  disclose such Confidential Information and shall use it only in
 |  accordance with the terms of the license agreement you entered
 |  into with Oracle.
 |
 |  ORACLE MAKES NO REPRESENTATIONS OR WARRANTIES ABOUT THE SUITABILITY OF THE
 |  SOFTWARE, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE
 |  IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
 |  PURPOSE, OR NON-INFRINGEMENT. ORACLE SHALL NOT BE LIABLE FOR ANY DAMAGES
 |  SUFFERED BY LICENSEE AS A RESULT OF USING, MODIFYING OR DISTRIBUTING
 |  THIS SOFTWARE OR ITS DERIVATIVES.
 |
 |  Copyright &#xA9; 2022. All Rights reserved
-->
<chapter xmlns   ="http://docbook.org/ns/docbook"
         xmlns:xl="http://www.w3.org/1999/xlink"
         xmlns:xi="http://www.w3.org/2001/XInclude"
         xml:id  ="igs-backend-about"
         xml:lang="de"
         version ="5.0">
  <title>Leitfaden f&#xFC;r IAM</title>
  <para>
    Identity und Access Management (IAM) ist ein Framework bestehend aus Gesch?ftsprozessen, Richtlinien und Technologien, der die Verwaltung elektronischer oder digitaler Identit&#xE4;ten erleichtert.
     Mit einem IAM-Framework k&#xF6;nnen IT-Manager den Benutzerzugriff auf kritische Informationen in ihren Organisationen kontrollieren.
     Systeme, die f&#xFC;r IAM verwendet werden, umfassen Single-Sign-On-Systeme, die w&#xE4;hrend der Ausf&#xFC;hrung aufgetreten sind.  
    <link xl:show="new"
          xl:href="https://en.wikipedia.org/wiki/Help:Two-factor_authentication"
          xl:role="http://docbook.org/xlink/role/olink">
      <citetitle>Zwei-Faktor Authentisierunc</citetitle>
    </link>,
    <link xl:show="new"
          xl:href="https://en.wikipedia.org/wiki/Multi-factor_authentication"
          xl:role="http://docbook.org/xlink/role/olink">
      <citetitle>Multi-Faktor Authentisierung</citetitle>
    </link> und
    <link xl:show="new"
          xl:href="https://en.wikipedia.org/wiki/Identity_management"
          xl:role="http://docbook.org/xlink/role/olink">
      <citetitle>Verwaltung privilegierter Benutzerkonten</citetitle>
    </link>.
    Diese Technologien bieten auch die M&#xF6;glichkeit, Identit&#xE4;ts- und Profildaten sicher zu speichern, sowie Governance-Funktionen, um sicherzustellen, dass nur notwendige und relevante Daten geteilt werden.
  </para>
  <para>
    IAM-Systeme k&#xF6;nnen vor Ort, von einem Drittanbieter &#xFC;ber ein Cloud-basiertes Abonnementmodell oder in einem Hybridmodell bereitgestellt werden.
  </para>
  <para>
    Auf grundlegender Ebene umfasst IAM die folgenden Komponenten:
    <itemizedlist mark='bullet'>
      <listitem>
        wie Personen in einem System identifiziert werden (den Unterschied zwischen Identit&#xE4;tsmanagement und Authentifizierung verstehen)
        <para/>
        <para/>
      </listitem>
      <listitem>
        wie Rollen in einem System identifiziert und Personen zugeordnet werden
        <para/>
        <para/>
      </listitem>
      <listitem>
        Hinzuf&#xFC;gen, Entfernen und Aktualisieren von Personen und deren Rollen in einem System
        <para/>
        <para/>
      </listitem>
      <listitem>
        Zuweisen von Zugriffsebenen zu Einzelpersonen oder Gruppen von Einzelpersonen
        <para/>
        <para/>
      </listitem>
      <listitem>
        Schutz der sensiblen Daten innerhalb des Systems und Sicherung des Systems selbst
        <para/>
        <para/>
      </listitem>
    </itemizedlist>
  </para>
  <section xml:id="igs-backend-about-importance">
    <title>Warum ist IAM wichtig?</title>
    <para>
      Unternehmensleitungen und IT-Abteilungen stehen unter erh&#xF6;htem regulatorischem und organisatorischem Druck, den Zugriff auf Unternehmensressourcen zu sch&#xFC;tzen.
      Infolgedessen k&#xF6;nnen sie sich nicht mehr auf manuelle und fehleranf&#xE4;llige Prozesse verlassen, um Benutzerrechte zuzuweisen und zu verfolgen.
      IAM automatisiert diese Aufgaben und erm&#xF6;glicht eine granulare Zugriffskontrolle und Pr&#xFC;fung aller Unternehmensressourcen vor Ort und in der Cloud.
    </para>
    <para>
      IAM, das &#xFC;ber eine st&#xE4;ndig wachsende Liste von Funktionen verf&#xFC;gt -- darunter Biometrie, Verhaltensanalyse und KI -- ist gut f&#xFC;r die Anforderungen der neuen Sicherheitslandschaft geeignet.
      Beispielsweise entspricht die strenge Kontrolle des Ressourcenzugriffs durch IAM in stark verteilten und dynamischen Umgebungen dem &#xDC;bergang der Branche von Firewalls zu Zero-Trust-Modellen und den Sicherheitsanforderungen von IoT.
    </para>
    <para>
      W&#xE4;hrend IT-Experten denken m&#xF6;gen, dass IAM etwas f&#xFC;r gr&#xF6;&#xDF;ere Organisationen mit gr&#xF6;&#xDF;eren Budgets ist, ist die Technologie in Wirklichkeit f&#xFC;r Unternehmen jeder Gr&#xF6;&#xDF;e zug&#xE4;nglich.
    </para>
  </section>
</chapter>