<?xml version="1.0" encoding="US-ASCII"?>
<!--
 |  Oracle Deutschland BV & Co. KG
 |
 |  This software is the confidential and proprietary information of
 |  Oracle Corporation. ("Confidential Information").  You shall not
 |  disclose such Confidential Information and shall use it only in
 |  accordance with the terms of the license agreement you entered
 |  into with Oracle.
 |
 |  ORACLE MAKES NO REPRESENTATIONS OR WARRANTIES ABOUT THE SUITABILITY OF THE
 |  SOFTWARE, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE
 |  IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
 |  PURPOSE, OR NON-INFRINGEMENT. ORACLE SHALL NOT BE LIABLE FOR ANY DAMAGES
 |  SUFFERED BY LICENSEE AS A RESULT OF USING, MODIFYING OR DISTRIBUTING
 |  THIS SOFTWARE OR ITS DERIVATIVES.
 |
 |  Copyright &#xA9; 2022. All Rights reserved
-->
<chapter xmlns   ="http://docbook.org/ns/docbook"
         xmlns:xl="http://www.w3.org/1999/xlink"
         xmlns:xi="http://www.w3.org/2001/XInclude"
         xml:id  ="uid-backend-about"
         xml:lang="fr"
         version ="5.0">
  <title>Introduction</title>
  <para>
    Pour acc&#xE9;der aux ressources (applications, donn&#xE9;es) fournies par le programme Police 20/20, le compte utilisateur existant pr&#xE9;vu &#xE0; cet effet sera enrichi d'un P20/20 -ID suppl&#xE9;mentaire (ci-apr&#xE8;s P20-UID) r&#xE9;alis&#xE9; selon une logique uniforme.
  </para>
  <para>
    Cet &#xAB; identifiant unique &#xBB; (le P20-UID) est mapp&#xE9; dans le mod&#xE8;le d'information de la police (MIP).
    Il est &#xE0; transmettre en communication entre les pays, le PSP, la data house via les interfaces P20/20.
    Le P20-UID identifie clairement la personne responsable d'une requ&#xEA;te ou d'un changement de donn&#xE9;es dans tous les services.
    Le P20-UID ne contient aucune donn&#xE9;e personnellement identifiable.
    Une affectation &#xE0; la personne ne peut &#xEA;tre faite qu'avec la participation du participant.
  </para>
  <para>
    Le P20-UID est utilis&#xE9; pour l'identification et pour la journalisation technique / de protection des donn&#xE9;es.
    Entre autres choses, le pays d'origine, le participant (INPOL) ou les institutions partenaires qui acc&#xE8;dent aux services P20/20 doivent en &#xEA;tre directement d&#xE9;duits.
  </para>
  <section xml:id  ="uid-about-term">
    <title>Terminologie</title>
    <section>
      <title>Participant</title>
      <para>
        Les participants sont les forces de police qui participent directement au programme Police 20/20, c'est-&#xE0;-dire toutes les forces de police nationales et f&#xE9;d&#xE9;rales (Office f&#xE9;d&#xE9;ral de la police criminelle, Police f&#xE9;d&#xE9;rale, Police du Bundestag et douanes) conform&#xE9;ment au BKAG &#xA7;29.
      </para>
    </section>
    <section>
      <title>Partenaire</title>
      <para>
        Dans ce document, les autorit&#xE9;s qui pourraient &#xE0; l'avenir acc&#xE9;der aux services du programme 20/20 dans le cadre de leurs missions r&#xE9;galiennes et/ou de coop&#xE9;ration polici&#xE8;re sont consid&#xE9;r&#xE9;es comme des partenaires, mais pas parmi les participants effectifs de Police 20/20.
      </para>
    </section>
    <section>
      <title>Identit&#xE9;</title>
      <para>
        Une identit&#xE9; est une description claire et reconnaissable d'une personne physique dans un contexte d'utilisation sp&#xE9;cifique.
        L'identit&#xE9; se compose d'attributs qui caract&#xE9;risent de mani&#xE8;re unique la personne.
      </para>
    </section>
    <section>
      <title>Compte d'utilisateur</title>
      <para>
        Un compte utilisateur, ou compte utilisateur en abr&#xE9;g&#xE9;, est une autorisation d'acc&#xE8;s &#xE0; un syst&#xE8;me informatique &#xE0; acc&#xE8;s restreint.
      </para>
    </section>
  </section>
  <section xml:id  ="uid-about-use">
    <title>But</title>
    <para>
      Ce guide d&#xE9;crit le processus d'installation du sch&#xE9;ma de base de donn&#xE9;es fourni de mani&#xE8;re centralis&#xE9;e par le g&#xE9;n&#xE9;rateur.
    </para>
  </section>
</chapter>