consent.title=Accord
consent.instruction=En cliquant sur Autoriser, vous autorisez cette application \u00E0 utiliser vos informations conform\u00E9ment aux domaines sp\u00E9cifi\u00E9s et êtes \u00E9galement soumis \u00E0 leurs conditions d'utilisation et \u00E0 leur politique de confidentialit\u00E9.
consent.action.accept=Autoriser
consent.action.reject=Rejeter
consent.app.name=L'application
consent.app.request=demande ce qui suit \u00E0 utiliser:
consent.400.code=400
consent.400.text=Mauvaise demande
consent.400.message=Tous les param\u00E8tres requis n'ont pas \u00E9t\u00E9 soumis pour mener \u00E0 bien le processus de connexion.
consent.400.activity=Contactez l'administrateur syst\u00E8me pour ajuster la configuration !
consent.403.code=403
consent.403.text=Interdit
consent.403.message=Cette page n'est pas correctement int\u00E9gr\u00E9e dans le processus d'enregistrement, c'est pourquoi les informations sur l'utilisateur \u00E0 enregistrer ne sont pas disponibles.
consent.403.activity=Contactez l'administrateur syst\u00E8me pour avoir acc\u00E8s \u00E0 cette ressource !

silent.approval=Vous \u00EAtes connect\u00E9 avec succ\u00E8s. La demande a \u00E9t\u00E9 approuv\u00E9e conform\u00E9ment \u00E0 un accord au niveau du syst\u00E8me.
silent.instruction=Le syst\u00E8me va maintenant ex\u00E9cuter l'autorisation. Vous serez bient\u00F4t redirig\u00E9 vers l'application.

error.title=Error
error.instruction=Error ...

failure.title=Failure
failure.instruction=Error ...

signin.title=Inscription
signin.action=Enregistrer
signin.submit=Enregistrer
signin.instruction=Connectez-vous \u00E0 votre compte utilisateur
signin.username=Nom d'utilisateur
signin.username.invalid=S'il vous pla\u00EEt entrez votre nom d'utilisateur
signin.password=Mot de passe
signin.password.invalid=S'il vous pla\u00EEt entrez votre mot de passe

signout.title=se d\u00E9connecter
signout.action=Enregistrer
signout.instruction=Vous avez \u00E9t\u00E9 d\u00E9connect\u00E9 avec succ\u00E8s!

OAM-1=Un nom d'utilisateur ou un mot de passe incorrect a \u00E9t\u00E9 sp\u00E9cifi\u00E9
OAM-2=Un nom d'utilisateur ou un mot de passe incorrect a \u00E9t\u00E9 sp\u00E9cifi\u00E9
OAM-3=Une erreur inattendue s'est produite lors du traitement des informations d'identification.<br>R\u00E9essayez l'action.
OAM-4=Erreur syst\u00E8me. Veuillez contacter l'administrateur syst\u00E8me.
OAM-5=Le compte d'utilisateur est verrouill\u00E9 ou d\u00E9sactiv\u00E9.<br>Contactez l'administrateur syst\u00E8me.
OAM-6=L'utilisateur a d\u00E9j\u00E0 atteint la limite du nombre maximal de sessions autoris\u00E9es.<br>Veuillez fermer l'une des sessions existantes avant d'essayer de vous reconnecter.
OAM-7=Erreur syst\u00E8me. R\u00E9essayez l'action.<br>Si cette erreur persiste, contactez votre administrateur.
OAM-8=\u00C9chec de l'authentification. 
OAM-9=Erreur syst\u00E8me. R\u00E9essayez l'action.<br>Si cette erreur persiste, contactez votre administrateur.
OAM-10=Le mot de passe a expir\u00E9. Veuillez contacter l'administrateur syst\u00E8me.
OAM-15=Nom de locataire invalide
OAM-16=Option non valide s\u00E9lectionn\u00E9e. Choisissez une option correcte.
OAM-17=Questions de mot de passe secret de l'utilisateur non d\u00E9finies
OAM-18=Impossible de continuer. Veuillez contacter l'administrateur syst\u00E8me.
OAM-19=Une mauvaise r\u00E9ponse a \u00E9t\u00E9 donn\u00E9e.
OAM-20=La politique des questions de mot de passe secret est d\u00E9sactiv\u00E9e.
OAM-21=L'ID de ressource externe n'est pas sur liste blanche et n'est donc pas accessible.