<?xml version='1.0' encoding='UTF-8'?>
<MessageCtlg xmlns="http://www.oblix.com" CtlgName="">
  <Message MsgTag="DCCErrorPage400">&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Transitional//EN&quot; &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd&quot;>&#10;&lt;html xmlns=&quot;http://www.w3.org/1999/xhtml&quot; xml:lang=&quot;en&quot; lang=&quot;en&quot;>&#10;&lt;head>&#10;&lt;title> &#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3586;&#3629;&#3591; Oracle Access Manager &lt;/title>&#10;&lt;meta http-equiv=&quot;Content-Type&quot; content=&quot;text/html; charset=UTF-8&quot; />&#10;&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/oamsso/global/loginTemplate.css&quot; />&#10;&lt;script language=&quot;javascript&quot; type=&quot;text/javascript&quot;>&#10;var currentPageLang = 'en-us';&#10;var isError;&#10;&#10;if (self==top) {&#10;  document.documentElement.style.visibility='visible';&#10;} else {&#10;  top.location=self.location;&#10;}&#10;&#10;&lt;/script>&#10;&lt;script language=&quot;javascript&quot; type=&quot;text/javascript&quot; src=&quot;/oamsso/global/config.js&quot;>&lt;/script>&#10;&lt;/head>&#10;&lt;body onload=&quot;javascript:onBodyLoad();&quot;>&#10;&#10;&lt;table id=&quot;branding&quot; class=&quot;branding&quot; width=&quot;100%2&quot; border=&quot;0&quot; cellpadding=&quot;0&quot; cellspacing=&quot;0&quot;>&#10;&lt;tbody>&#10;&lt;tr>&#10;&lt;td id=&quot;logoCell&quot; class=&quot;logo&quot; valign=&quot;middle&quot; width=&quot;119&quot; height=&quot;25&quot;>&#10;&lt;img id=&quot;appLogo&quot; src=&quot;/oamsso/global/images/oracle_logo.png&quot; alt=&quot;ORACLE&quot; width=&quot;119&quot; border=&quot;0&quot; height=&quot;25&quot; />&#10;&lt;/td>&#10;&lt;td class=&quot;topbody bottomborder&quot; valign=&quot;top&quot; width=&quot;*&quot; align=&quot;left&quot;>&#10;&lt;span id=&quot;appName&quot; style=&quot;position: absolute; top: 2px; left: 120px;&quot; class=&quot;appname&quot;> Access Manager &lt;/span>&#10;&lt;/td>&#10;&lt;td class=&quot;padding-right12 topbody bottomborder&quot; align=&quot;right&quot; nowrap=&quot;nowrap&quot;>&#10;&lt;div align=&quot;right&quot;>&#10;&lt;img src=&quot;/oamsso/global/images/spacer.gif&quot; alt=&quot;X&quot; width=&quot;11&quot; height=&quot;1&quot; />&#10;&lt;a id=&quot;helpLink&quot; class=&quot;pagelink&quot; href=&quot;#&quot;> &#3623;&#3636;&#3608;&#3637;&#3651;&#3594;&#3657; &lt;/a>&#10;&lt;/div>&#10;&lt;/td>&#10;&lt;/tr>&#10;&lt;/tbody>&#10;&lt;/table>&#10;&lt;table width=&quot;100%2&quot; border=&quot;0&quot; cellpadding=&quot;0&quot; &#10;  cellspacing=&quot;10&quot;>&#10;  &lt;tbody>&#10;  &lt;tr>&#10;  &lt;td rowspan=&quot;2&quot; valign=&quot;middle&quot; width=&quot;16%2&quot;>&#10;  &lt;div align=&quot;center&quot;>&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;table width=&quot;290&quot; border=&quot;0&quot; cellpadding=&quot;0&quot; cellspacing=&quot;0&quot;>&#10;  &lt;tbody>&#10;  &lt;tr>&#10;  &lt;td class=&quot;lefttop&quot;>&lt;/td>&#10;  &lt;td class=&quot;topmiddle&quot; width=&quot;100%2&quot; height=&quot;12&quot;>&lt;/td>&#10;  &lt;td class=&quot;righttop&quot;>&lt;/td>&#10;  &lt;/tr>&#10;  &lt;tr>&#10;  &lt;td class=&quot;leftmiddle&quot;>&lt;/td>&#10;  &lt;td class=&quot;boxcontent&quot; width=&quot;100&quot;>&#10;  &lt;table width=&quot;100%2&quot; cellpadding=&quot;0&quot; cellspacing=&quot;0&quot;>&#10;  &lt;tbody>&#10;  &lt;tr>&#10;  &lt;td nowrap=&quot;nowrap&quot; class=&quot;loginlabel&quot;> &#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3586;&#3629;&#3591; Oracle Access Manager &lt;/td>&#10;  &lt;/tr>&#10;  &lt;tr>&#10;  &lt;td nowrap=&quot;nowrap&quot; class=&quot;inlineerror&quot;>&lt;br /> %1 &lt;br />  &lt;br />&#10;  &lt;br />&lt;/td>&#10;  &lt;/tr>&#10;  &lt;/tbody>&#10;  &lt;/table>&#10;  &lt;/td>&#10;  &lt;td class=&quot;rightmiddle&quot;>&lt;/td>&#10;  &lt;/tr>&#10;  &lt;tr>&#10;  &lt;td class=&quot;leftbottom&quot;>&lt;/td>&#10;  &lt;td class=&quot;bottommiddle&quot; width=&quot;100%2&quot; height=&quot;12&quot;>&lt;/td>&#10;  &lt;td class=&quot;rightbottom&quot;>&lt;/td>&#10;  &lt;/tr>&#10;  &lt;/tbody>&#10;  &lt;/table>&#10;  &lt;/div>&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;br />&#10;  &lt;/td>&#10;  &lt;/tr>&#10;  &lt;/tbody>&#10;  &lt;/table>&#10;&#10;&lt;table id=&quot;footer&quot; class=&quot;footer&quot; width=&quot;100%2&quot; border=&quot;0&quot; cellpadding=&quot;0&quot; cellspacing=&quot;0&quot;>&#10;&lt;tbody>&#10;&lt;tr>&#10;&lt;td>&#10;&lt;br />&#10;&lt;br />&#10;&lt;br />&#10;&lt;br />&#10;&lt;/td>&#10;&lt;/tr>&#10;&lt;tr>&#10;&lt;td id=&quot;copyRight&quot; class=&quot;Copyright&quot;> &#3621;&#3636;&#3586;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; 2010 Oracle &#3626;&#3591;&#3623;&#3609;&#3621;&#3636;&#3586;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; &lt;/td>&#10;&lt;td>&#10;&lt;div align=&quot;right&quot;>&#10;&lt;p>&lt;a class=&quot;pagelink&quot; id=&quot;aboutProduct&quot; href=&quot;#&quot;> &#3648;&#3585;&#3637;&#3656;&#3618;&#3623;&#3585;&#3633;&#3610;&#3612;&#3621;&#3636;&#3605;&#3616;&#3633;&#3603;&#3601;&#3660; &lt;/a> &lt;span class=&quot;mtext&quot;>|&lt;/span> &lt;a id=&quot;legalNote&quot; class=&quot;padding-right12 pagelink&quot; href=&quot;#&quot;> &#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3604;&#3657;&#3634;&#3609;&#3585;&#3598;&#3627;&#3617;&#3634;&#3618; &lt;/a> &lt;span class=&quot;mtext&quot;>|&lt;/span> &lt;a id=&quot;termsOfUse&quot; class=&quot;padding-right12 pagelink&quot; href=&quot;#&quot;> &#3648;&#3591;&#3639;&#3656;&#3629;&#3609;&#3652;&#3586;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3591;&#3634;&#3609; &lt;/a> &lt;span class=&quot;mtext&quot;>|&lt;/span> &lt;a id=&quot;privacyPolicy&quot; class=&quot;padding-right12 pagelink&quot; href=&quot;#&quot;> &#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3585;&#3634;&#3619;&#3619;&#3633;&#3585;&#3625;&#3634;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3586;&#3629;&#3591;&#3588;&#3640;&#3603; &lt;/a> &lt;/p>&#10;&lt;/div>&#10;&lt;/td>&#10;&lt;/tr>&#10;&lt;/tbody>&#10;&lt;/table>&#10;&lt;script language=&quot;javascript&quot; type=&quot;text/javascript&quot;>&#10;setCustomHeaderFooter();&#10;&lt;/script>&#10;&lt;/body>&#10;&lt;/html></Message>
  <Message MsgTag="DominoHTMLpage302">&lt;html>&lt;head>&lt;title>302 &#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3648;&#3626;&#3657;&#3609;&#3607;&#3634;&#3591;&lt;/title>&lt;META HTTP-EQUIV=&quot;Content-Type&quot; CONTENT=&quot;text/html; charset=utf-8&quot;>&lt;/head>&lt;body>&lt;h1>302 &#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3648;&#3626;&#3657;&#3609;&#3607;&#3634;&#3591;&lt;/h1>&lt;/body>&lt;/html></Message>
  <Message MsgTag="DominoHTMLpage400">&lt;html>&lt;head>&lt;title>&#3588;&#3635;&#3586;&#3629;&#3586;&#3629;&#3591; Oracle Access Manager &#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;&lt;/title>&lt;META HTTP-EQUIV=&quot;Content-Type&quot; CONTENT=&quot;text/html; charset=utf-8&quot;>&lt;/head>&lt;body>&lt;h1>&#3588;&#3635;&#3586;&#3629;&#3586;&#3629;&#3591; Oracle Access Manager &#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;&lt;/h1>&lt;/body>&lt;/html></Message>
  <Message MsgTag="DominoHTMLpage401">&lt;html>&lt;head>&lt;title>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604; 401&lt;/title>&lt;META HTTP-EQUIV=&quot;Content-Type&quot; CONTENT=&quot;text/html; charset=utf-8&quot;>&lt;/head>&lt;body>&lt;h2>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604; HTTP 401&lt;/h2>&lt;p>&lt;strong>401 &#3652;&#3617;&#3656;&#3617;&#3637;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;: &#3585;&#3634;&#3619;&#3621;&#3655;&#3629;&#3585;&#3629;&#3629;&#3609;&#3621;&#3657;&#3617;&#3648;&#3627;&#3621;&#3623;&lt;/strong>&lt;/p>&lt;p>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3609;&#3637;&#3657;&#3649;&#3626;&#3604;&#3591;&#3623;&#3656;&#3634;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3607;&#3637;&#3656;&#3619;&#3632;&#3610;&#3640;&#3651;&#3627;&#3657;&#3585;&#3633;&#3610;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660;&#3652;&#3617;&#3656;&#3605;&#3619;&#3591;&#3585;&#3633;&#3610;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3651;&#3609;&#3585;&#3634;&#3619;&#3621;&#3655;&#3629;&#3585;&#3629;&#3629;&#3609;&#3648;&#3586;&#3657;&#3634;&#3626;&#3641;&#3656;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660;&lt;/p>&lt;p>&#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3619;&#3632;&#3610;&#3610;&#3586;&#3629;&#3591;&#3648;&#3623;&#3655;&#3610;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660; &#3648;&#3614;&#3639;&#3656;&#3629;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3623;&#3656;&#3634;&#3588;&#3640;&#3603;&#3617;&#3637;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3648;&#3586;&#3657;&#3634;&#3651;&#3594;&#3657;&#3607;&#3619;&#3633;&#3614;&#3618;&#3634;&#3585;&#3619;&#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&lt;/p>&lt;/body>&lt;/html></Message>
  <Message MsgTag="DominoHTMLpage403">&lt;html>&lt;head>&lt;title>403 &#3627;&#3657;&#3634;&#3617;&#3651;&#3594;&#3657;&lt;/title>&lt;META HTTP-EQUIV=&quot;Content-Type&quot; CONTENT=&quot;text/html; charset=utf-8&quot;>&lt;/head>&lt;body>&lt;h1>403 &#3627;&#3657;&#3634;&#3617;&#3651;&#3594;&#3657;&lt;/h1>&lt;/body>&lt;/html></Message>
  <Message MsgTag="DominoHTMLpage404">&lt;html>&lt;head>&lt;title>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604; 404&lt;/title>&lt;META HTTP-EQUIV=&quot;Content-Type&quot; CONTENT=&quot;text/html; charset=utf-8&quot;>&lt;/head>&lt;body>&lt;h2>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604; HTTP 404&lt;/h2>&lt;p>&lt;strong>404 &#3652;&#3617;&#3656;&#3614;&#3610;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&lt;/strong>&lt;/p>&lt;p>&#3648;&#3623;&#3655;&#3610;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660;&#3652;&#3617;&#3656;&#3614;&#3610;&#3652;&#3615;&#3621;&#3660;&#3627;&#3619;&#3639;&#3629;&#3626;&#3588;&#3619;&#3636;&#3611;&#3605;&#3660;&#3607;&#3637;&#3656;&#3588;&#3640;&#3603;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619; &#3650;&#3611;&#3619;&#3604;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610; URL &#3623;&#3656;&#3634;&#3614;&#3634;&#3608;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;&lt;/p>&lt;p>&#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3619;&#3632;&#3610;&#3610;&#3586;&#3629;&#3591;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660; &#3627;&#3634;&#3585;&#3611;&#3633;&#3597;&#3627;&#3634;&#3609;&#3637;&#3657;&#3652;&#3617;&#3656;&#3652;&#3604;&#3657;&#3619;&#3633;&#3610;&#3585;&#3634;&#3619;&#3649;&#3585;&#3657;&#3652;&#3586;&lt;/p>&lt;/body>&lt;/html></Message>
  <Message MsgTag="DominoHTMLpage500">&lt;html>&lt;head>&lt;title>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3651;&#3609;&#3585;&#3634;&#3619;&#3607;&#3635;&#3591;&#3634;&#3609;&#3586;&#3629;&#3591; Oracle Access Manager&lt;/title>&lt;META HTTP-EQUIV=&quot;Content-Type&quot; CONTENT=&quot;text/html; charset=utf-8&quot;>&lt;/head>&lt;body>&lt;h1>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3651;&#3609;&#3585;&#3634;&#3619;&#3607;&#3635;&#3591;&#3634;&#3609;&#3586;&#3629;&#3591; Oracle Access Manager&lt;/h1>&lt;p>&#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3648;&#3623;&#3655;&#3610;&#3652;&#3595;&#3605;&#3660;&#3648;&#3614;&#3639;&#3656;&#3629;&#3649;&#3585;&#3657;&#3652;&#3586;&#3611;&#3633;&#3597;&#3627;&#3634;&#3609;&#3637;&#3657;&lt;/p>&lt;/body>&lt;/html></Message>
  <Message MsgTag="ErrAXMLServerDown">&#3614;&#3619;&#3655;&#3629;&#3585;&#3595;&#3637;&#3656; AccessXML &#3586;&#3629;&#3591; WebGate &#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3585;&#3633;&#3610;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660; AccessXML &#3650;&#3611;&#3619;&#3604;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3623;&#3656;&#3634;&#3617;&#3637;&#3585;&#3634;&#3619;&#3605;&#3633;&#3657;&#3591;&#3588;&#3656;&#3634;&#3652;&#3615;&#3621;&#3660; AccessXMLProxy.lst &#3652;&#3623;&#3657;</Message>
  <Message MsgTag="ErrAssociateNoTrustWithAssociate">&#3652;&#3617;&#3656;&#3617;&#3637;&#3585;&#3634;&#3619;&#3618;&#3629;&#3617;&#3619;&#3633;&#3610;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3650;&#3604;&#3648;&#3617;&#3609;&#3607;&#3637;&#3656;&#3648;&#3594;&#3639;&#3656;&#3629;&#3617;&#3650;&#3618;&#3591;</Message>
  <Message MsgTag="ErrAssociateNoTrustWithMain">&#3652;&#3617;&#3656;&#3617;&#3637;&#3585;&#3634;&#3619;&#3618;&#3629;&#3617;&#3619;&#3633;&#3610;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3650;&#3604;&#3648;&#3617;&#3609;&#3627;&#3621;&#3633;&#3585;!</Message>
  <Message MsgTag="ErrAssociateUnTrustedCookie">&#3588;&#3640;&#3585;&#3585;&#3637;&#3657;&#3607;&#3637;&#3656;&#3648;&#3594;&#3639;&#3656;&#3629;&#3617;&#3650;&#3618;&#3591;&#3652;&#3617;&#3656;&#3617;&#3637;&#3585;&#3634;&#3619;&#3618;&#3629;&#3617;&#3619;&#3633;&#3610;!</Message>
  <Message MsgTag="ErrAssociateUnTrustedMainToken">&#3652;&#3617;&#3656;&#3618;&#3629;&#3617;&#3619;&#3633;&#3610;&#3650;&#3607;&#3648;&#3588;&#3655;&#3609;&#3586;&#3629;&#3591;&#3650;&#3604;&#3648;&#3617;&#3609;&#3627;&#3621;&#3633;&#3585;!</Message>
  <Message MsgTag="ErrAuthnFailLoop">&#3605;&#3657;&#3629;&#3591;&#3617;&#3637;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; URL &#3607;&#3637;&#3656;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3648;&#3626;&#3657;&#3609;&#3607;&#3634;&#3591; %1 &#3595;&#3638;&#3656;&#3591;&#3585;&#3635;&#3627;&#3609;&#3604;&#3652;&#3623;&#3657;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3607;&#3637;&#3656;&#3621;&#3657;&#3617;&#3648;&#3627;&#3621;&#3623; URL &#3609;&#3637;&#3657;&#3652;&#3617;&#3656;&#3588;&#3623;&#3619;&#3617;&#3637;&#3585;&#3634;&#3619;&#3611;&#3657;&#3629;&#3591;&#3585;&#3633;&#3609;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;</Message>
  <Message MsgTag="ErrAuthnPluginAbort">&#3611;&#3621;&#3633;&#3658;&#3585;&#3629;&#3636;&#3609;&#3586;&#3629;&#3591;&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3652;&#3604;&#3657;&#3621;&#3657;&#3617;&#3648;&#3621;&#3636;&#3585;&#3585;&#3634;&#3619;&#3611;&#3619;&#3632;&#3617;&#3623;&#3621;&#3612;&#3621;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;</Message>
  <Message MsgTag="ErrAuthnPluginDenied">&#3611;&#3621;&#3633;&#3658;&#3585;&#3629;&#3636;&#3609;&#3586;&#3629;&#3591;&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3611;&#3599;&#3636;&#3648;&#3626;&#3608;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;</Message>
  <Message MsgTag="ErrAuthnPluginNoUser">&#3611;&#3621;&#3633;&#3658;&#3585;&#3629;&#3636;&#3609;&#3607;&#3637;&#3656;&#3588;&#3629;&#3609;&#3615;&#3636;&#3648;&#3585;&#3629;&#3619;&#3660;&#3652;&#3623;&#3657;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3652;&#3617;&#3656;&#3652;&#3604;&#3657;&#3648;&#3621;&#3639;&#3629;&#3585;&#3650;&#3611;&#3619;&#3652;&#3615;&#3621;&#3660;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;</Message>
  <Message MsgTag="ErrAuthzDeny">&#3619;&#3632;&#3610;&#3610;&#3611;&#3599;&#3636;&#3648;&#3626;&#3608;&#3585;&#3634;&#3619;&#3648;&#3586;&#3657;&#3634;&#3651;&#3594;&#3657; URL %2 &#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;</Message>
  <Message MsgTag="ErrAuthzFailLoop">URL &#3607;&#3637;&#3656;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3648;&#3626;&#3657;&#3609;&#3607;&#3634;&#3591; %1 &#3607;&#3637;&#3656;&#3585;&#3635;&#3627;&#3609;&#3604;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3585;&#3634;&#3619;&#3651;&#3627;&#3657;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3607;&#3637;&#3656;&#3621;&#3657;&#3617;&#3648;&#3627;&#3621;&#3623;&#3652;&#3617;&#3656;&#3612;&#3656;&#3634;&#3609;&#3585;&#3634;&#3619;&#3651;&#3627;&#3657;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; &#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3609;&#3637;&#3657;&#3652;&#3617;&#3656;&#3588;&#3623;&#3619;&#3617;&#3637;&#3585;&#3634;&#3619;&#3611;&#3657;&#3629;&#3591;&#3585;&#3633;&#3609;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621; &#3649;&#3621;&#3632;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3607;&#3640;&#3585;&#3588;&#3609;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3594;&#3657;&#3591;&#3634;&#3609;&#3652;&#3604;&#3657;</Message>
  <Message MsgTag="ErrBadAuthnScheme">&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609;&#3648;&#3611;&#3655;&#3609;&#3588;&#3656;&#3634;&#3607;&#3637;&#3656;&#3611;&#3621;&#3633;&#3658;&#3585;&#3629;&#3636;&#3609;&#3586;&#3629;&#3591; WebGate &#3652;&#3617;&#3656;&#3619;&#3641;&#3657;&#3592;&#3633;&#3585; &#3619;&#3641;&#3611;&#3649;&#3610;&#3610;&#3586;&#3629;&#3591;&#3626;&#3588;&#3637;&#3617;&#3588;&#3639;&#3629; %1</Message>
  <Message MsgTag="ErrBadAuthzHeader">&#3626;&#3656;&#3623;&#3609;&#3627;&#3633;&#3623;&#3586;&#3629;&#3591;&#3585;&#3634;&#3619;&#3651;&#3627;&#3657;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; HTTP &#3652;&#3617;&#3656;&#3617;&#3637;&#3619;&#3641;&#3611;&#3649;&#3610;&#3610;&#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3586;&#3633;&#3657;&#3609;&#3605;&#3657;&#3609;</Message>
  <Message MsgTag="ErrBadEndUrl">end_url &#3651;&#3609;&#3588;&#3635;&#3586;&#3629;&#3621;&#3655;&#3629;&#3585;&#3648;&#3629;&#3634;&#3605;&#3660;&#3617;&#3637;&#3619;&#3641;&#3611;&#3649;&#3610;&#3610;&#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591; &#3627;&#3619;&#3639;&#3629;&#3652;&#3617;&#3656;&#3652;&#3604;&#3657;&#3629;&#3618;&#3641;&#3656;&#3651;&#3609;&#3650;&#3604;&#3648;&#3617;&#3609;&#3607;&#3637;&#3656;&#3648;&#3594;&#3639;&#3656;&#3629;&#3606;&#3639;&#3629;</Message>
  <Message MsgTag="ErrBadLogoutRedirect">&#3614;&#3634;&#3619;&#3634;&#3617;&#3636;&#3648;&#3605;&#3629;&#3619;&#3660; logoutRedirectUrl &#3652;&#3617;&#3656;&#3652;&#3604;&#3657;&#3648;&#3619;&#3636;&#3656;&#3617;&#3605;&#3657;&#3609;&#3604;&#3657;&#3623;&#3618; http:// &#3627;&#3619;&#3639;&#3629; https:// &#3627;&#3619;&#3639;&#3629;&#3607;&#3635;&#3651;&#3627;&#3657;&#3648;&#3585;&#3636;&#3604;&#3585;&#3634;&#3619;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3648;&#3626;&#3657;&#3609;&#3607;&#3634;&#3591;&#3649;&#3610;&#3610;&#3623;&#3609;&#3595;&#3657;&#3635;</Message>
  <Message MsgTag="ErrBadRedirect">URL &#3607;&#3637;&#3656;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3648;&#3626;&#3657;&#3609;&#3607;&#3634;&#3591; %2 &#3607;&#3637;&#3656;&#3585;&#3635;&#3627;&#3609;&#3604;&#3651;&#3609;&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3652;&#3617;&#3656;&#3652;&#3604;&#3657;&#3648;&#3619;&#3636;&#3656;&#3617;&#3605;&#3657;&#3609;&#3604;&#3657;&#3623;&#3618; http:// &#3627;&#3619;&#3639;&#3629; https:// &#3627;&#3619;&#3639;&#3629;&#3652;&#3617;&#3656;&#3652;&#3604;&#3657;&#3607;&#3635;&#3651;&#3627;&#3657;&#3648;&#3585;&#3636;&#3604;&#3585;&#3634;&#3619;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3648;&#3626;&#3657;&#3609;&#3607;&#3634;&#3591;&#3607;&#3637;&#3656;&#3623;&#3609;&#3595;&#3657;&#3635;</Message>
  <Message MsgTag="ErrEngineDown">&#3611;&#3621;&#3633;&#3658;&#3585;&#3629;&#3636;&#3609;&#3586;&#3629;&#3591; WebGate &#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3585;&#3633;&#3610; Access Server</Message>
  <Message MsgTag="ErrEvilDCCCtxCookie">&#3588;&#3640;&#3585;&#3585;&#3637;&#3657;&#3586;&#3629;&#3591;&#3588;&#3629;&#3609;&#3648;&#3607;&#3655;&#3585;&#3595;&#3660; DCC &#3651;&#3609; URL &#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3648;&#3585;&#3636;&#3609;&#3586;&#3637;&#3604;&#3592;&#3635;&#3585;&#3633;&#3604;&#3626;&#3641;&#3591;&#3626;&#3640;&#3604;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3652;&#3604;&#3657;</Message>
  <Message MsgTag="ErrEvilUrl">URL &#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619; %1 &#3617;&#3637;&#3629;&#3633;&#3585;&#3586;&#3619;&#3632;&#3607;&#3637;&#3656;&#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;</Message>
  <Message MsgTag="ErrException">&#3648;&#3585;&#3636;&#3604;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3651;&#3609; Access Server</Message>
  <Message MsgTag="ErrFormLoginLoop">&#3615;&#3629;&#3619;&#3660;&#3617;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609; %1 &#3607;&#3637;&#3656;&#3585;&#3635;&#3627;&#3609;&#3604;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3586;&#3629;&#3591;&#3615;&#3629;&#3619;&#3660;&#3617;&#3605;&#3657;&#3629;&#3591;&#3617;&#3637;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; &#3615;&#3629;&#3619;&#3660;&#3617;&#3609;&#3637;&#3657;&#3652;&#3617;&#3656;&#3588;&#3623;&#3619;&#3617;&#3637;&#3585;&#3634;&#3619;&#3611;&#3657;&#3629;&#3591;&#3585;&#3633;&#3609;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;</Message>
  <Message MsgTag="ErrHostPortLookupFailed">&#3652;&#3617;&#3656;&#3614;&#3610;&#3650;&#3630;&#3626;&#3605;&#3660;&#3649;&#3621;&#3632;&#3614;&#3629;&#3619;&#3660;&#3605;&#3592;&#3634;&#3585; URL &#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3651;&#3609;&#3600;&#3634;&#3609;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3586;&#3657;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604; &#3650;&#3611;&#3619;&#3604;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3623;&#3656;&#3634;&#3652;&#3604;&#3648;&#3619;&#3588;&#3607;&#3629;&#3619;&#3637;&#3648;&#3595;&#3629;&#3619;&#3660;&#3623;&#3636;&#3626;&#3607;&#3635;&#3591;&#3634;&#3609;&#3629;&#3618;&#3641;&#3656;</Message>
  <Message MsgTag="ErrInvalidCertificate">&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3619;&#3633;&#3610;&#3619;&#3629;&#3591;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609;&#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;</Message>
  <Message MsgTag="ErrInvalidSchemeId">&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591; &#3627;&#3619;&#3639;&#3629;&#3606;&#3641;&#3585;&#3648;&#3621;&#3636;&#3585;&#3651;&#3594;&#3657;&#3591;&#3634;&#3609;</Message>
  <Message MsgTag="ErrInvalidSchemeMapping">&#3585;&#3634;&#3619;&#3649;&#3617;&#3611;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3585;&#3633;&#3610;&#3650;&#3611;&#3619;&#3652;&#3615;&#3621;&#3660;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3621;&#3657;&#3617;&#3648;&#3627;&#3621;&#3623; Access Server &#3629;&#3634;&#3592;&#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3648;&#3594;&#3639;&#3656;&#3629;&#3617;&#3605;&#3656;&#3629;&#3585;&#3633;&#3610;&#3652;&#3604;&#3648;&#3619;&#3588;&#3607;&#3629;&#3619;&#3637;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657; &#3627;&#3619;&#3639;&#3629;&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3629;&#3634;&#3592;&#3617;&#3637;&#3614;&#3634;&#3619;&#3634;&#3617;&#3636;&#3648;&#3605;&#3629;&#3619;&#3660; obMappingFilter &#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3611;&#3621;&#3633;&#3658;&#3585;&#3629;&#3636;&#3609; credential_mapping</Message>
  <Message MsgTag="ErrInvalidSchemeParameters">&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3617;&#3637;&#3614;&#3634;&#3619;&#3634;&#3617;&#3636;&#3648;&#3605;&#3629;&#3619;&#3660;&#3607;&#3637;&#3656;&#3588;&#3629;&#3609;&#3615;&#3636;&#3648;&#3585;&#3629;&#3619;&#3660;&#3652;&#3623;&#3657;&#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;</Message>
  <Message MsgTag="ErrMissingAuthPlugin">&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3652;&#3617;&#3656;&#3617;&#3637;&#3611;&#3621;&#3633;&#3658;&#3585;&#3629;&#3636;&#3609;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3607;&#3637;&#3656;&#3588;&#3629;&#3609;&#3615;&#3636;&#3648;&#3585;&#3629;&#3619;&#3660;&#3652;&#3623;&#3657;</Message>
  <Message MsgTag="ErrMissingAuthnStep">&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3652;&#3617;&#3656;&#3617;&#3637;&#3586;&#3633;&#3657;&#3609;&#3605;&#3629;&#3609;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3607;&#3637;&#3656;&#3588;&#3629;&#3609;&#3615;&#3636;&#3648;&#3585;&#3629;&#3619;&#3660;&#3652;&#3623;&#3657;</Message>
  <Message MsgTag="ErrMissingCertificate">&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609;&#3652;&#3617;&#3656;&#3617;&#3637;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3619;&#3633;&#3610;&#3619;&#3629;&#3591;&#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;</Message>
  <Message MsgTag="ErrMissingObCredentialPassword">&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3652;&#3617;&#3656;&#3617;&#3637;&#3614;&#3634;&#3619;&#3634;&#3617;&#3636;&#3648;&#3605;&#3629;&#3619;&#3660; ObCredentialPassword &#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3651;&#3609;&#3611;&#3621;&#3633;&#3658;&#3585;&#3629;&#3636;&#3609; validate_password</Message>
  <Message MsgTag="ErrMissingPassword">&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609;&#3652;&#3617;&#3656;&#3617;&#3637;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;</Message>
  <Message MsgTag="ErrNeedHTTPSRedirect">URL &#3607;&#3637;&#3656;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3648;&#3626;&#3657;&#3609;&#3607;&#3634;&#3591; %2 &#3595;&#3638;&#3656;&#3591;&#3585;&#3635;&#3627;&#3609;&#3604;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3607;&#3637;&#3656;&#3617;&#3637;&#3585;&#3634;&#3619;&#3619;&#3633;&#3585;&#3625;&#3634;&#3588;&#3623;&#3634;&#3617;&#3611;&#3621;&#3629;&#3604;&#3616;&#3633;&#3618;&#3651;&#3609;&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3652;&#3617;&#3656;&#3651;&#3594;&#3656; https</Message>
  <Message MsgTag="ErrNoAuthentScheme">&#3652;&#3617;&#3656;&#3617;&#3637;&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3607;&#3637;&#3656;&#3585;&#3635;&#3627;&#3609;&#3604;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3585;&#3598;&#3627;&#3619;&#3639;&#3629;&#3650;&#3604;&#3648;&#3617;&#3609;&#3586;&#3629;&#3591;&#3586;&#3657;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3585;&#3633;&#3610; URL &#3649;&#3621;&#3632;&#3585;&#3634;&#3619;&#3607;&#3635;&#3591;&#3634;&#3609;&#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;</Message>
  <Message MsgTag="ErrNoCode">Access Server &#3649;&#3626;&#3604;&#3591;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3619;&#3657;&#3634;&#3618;&#3649;&#3619;&#3591; &#3650;&#3604;&#3618;&#3652;&#3617;&#3656;&#3617;&#3637;&#3619;&#3634;&#3618;&#3621;&#3632;&#3648;&#3629;&#3637;&#3618;&#3604;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;</Message>
  <Message MsgTag="ErrNoFormUrl">&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3586;&#3629;&#3591;&#3615;&#3629;&#3619;&#3660;&#3617; %1 &#3652;&#3617;&#3656;&#3617;&#3637;&#3614;&#3634;&#3619;&#3634;&#3617;&#3636;&#3648;&#3605;&#3629;&#3619;&#3660;&#3588;&#3635;&#3606;&#3634;&#3617;&#3607;&#3604;&#3626;&#3629;&#3610; form:formURL &#3650;&#3604;&#3618;&#3607;&#3637;&#3656; formURL &#3648;&#3611;&#3655;&#3609; URL &#3586;&#3629;&#3591;&#3615;&#3629;&#3619;&#3660;&#3617;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609;</Message>
  <Message MsgTag="ErrNoSyncRecord">&#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3648;&#3619;&#3637;&#3618;&#3585;&#3648;&#3619;&#3588;&#3588;&#3629;&#3619;&#3660;&#3604;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3648;&#3621;&#3586;&#3621;&#3635;&#3604;&#3633;&#3610; %1 &#3619;&#3632;&#3610;&#3610;&#3652;&#3617;&#3656;&#3611;&#3619;&#3632;&#3617;&#3623;&#3621;&#3612;&#3621;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;</Message>
  <Message MsgTag="ErrNoUser">&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3651;&#3609;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609;&#3652;&#3617;&#3656;&#3605;&#3619;&#3591;&#3585;&#3633;&#3610;&#3650;&#3611;&#3619;&#3652;&#3615;&#3621;&#3660;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3651;&#3609; Identity System</Message>
  <Message MsgTag="ErrNonUniqueUser">&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3651;&#3609;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609;&#3605;&#3619;&#3591;&#3585;&#3633;&#3610;&#3650;&#3611;&#3619;&#3652;&#3615;&#3621;&#3660;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3617;&#3634;&#3585;&#3585;&#3623;&#3656;&#3634;&#3627;&#3609;&#3638;&#3656;&#3591;&#3650;&#3611;&#3619;&#3652;&#3615;&#3621;&#3660;&#3651;&#3609; Identity System &#3588;&#3656;&#3634;&#3609;&#3637;&#3657;&#3592;&#3632;&#3605;&#3657;&#3629;&#3591;&#3652;&#3617;&#3656;&#3595;&#3657;&#3635;&#3585;&#3633;&#3609;</Message>
  <Message MsgTag="ErrNullResource">URL &#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3652;&#3617;&#3656;&#3617;&#3637;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;</Message>
  <Message MsgTag="ErrPasswdChangeOnReset">&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3607;&#3637;&#3656;&#3617;&#3637;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3652;&#3617;&#3656;&#3652;&#3604;&#3657;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609; &#3648;&#3609;&#3639;&#3656;&#3629;&#3591;&#3592;&#3634;&#3585;&#3617;&#3637;&#3585;&#3634;&#3619;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3649;&#3611;&#3621;&#3591;&#3586;&#3657;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;</Message>
  <Message MsgTag="ErrPasswdExpired">&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3586;&#3629;&#3591;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3627;&#3617;&#3604;&#3629;&#3634;&#3618;&#3640;&#3649;&#3621;&#3657;&#3623;</Message>
  <Message MsgTag="ErrPostDataExceed">&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3607;&#3637;&#3656;&#3650;&#3614;&#3626;&#3605;&#3660;&#3648;&#3585;&#3636;&#3609;&#3586;&#3637;&#3604;&#3592;&#3635;&#3585;&#3633;&#3604;&#3626;&#3641;&#3591;&#3626;&#3640;&#3604;&#3607;&#3637;&#3656;&#3588;&#3629;&#3609;&#3615;&#3636;&#3648;&#3585;&#3629;&#3619;&#3660;&#3652;&#3604;&#3657;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;</Message>
  <Message MsgTag="ErrReservedCookie">&#3588;&#3640;&#3585;&#3585;&#3637;&#3657; %1 &#3626;&#3591;&#3623;&#3609;&#3652;&#3623;&#3657;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3651;&#3594;&#3657;&#3650;&#3604;&#3618; Oracle Access Manager &#3649;&#3621;&#3632;&#3617;&#3637;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3585;&#3633;&#3610;&#3614;&#3634;&#3619;&#3634;&#3617;&#3636;&#3648;&#3605;&#3629;&#3619;&#3660;&#3607;&#3637;&#3656;&#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;</Message>
  <Message MsgTag="ErrReservedURL">URL &#3626;&#3591;&#3623;&#3609;&#3652;&#3623;&#3657;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3651;&#3594;&#3657;&#3650;&#3604;&#3618; Oracle Access Manager &#3649;&#3621;&#3632;&#3617;&#3637;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3585;&#3633;&#3610;&#3614;&#3634;&#3619;&#3634;&#3617;&#3636;&#3648;&#3605;&#3629;&#3619;&#3660;&#3607;&#3637;&#3656;&#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;</Message>
  <Message MsgTag="ErrSDLookupFailed">&#3652;&#3617;&#3656;&#3614;&#3610;&#3650;&#3604;&#3648;&#3617;&#3609;&#3586;&#3629;&#3591;&#3586;&#3657;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604;&#3607;&#3637;&#3656;&#3617;&#3637; URL &#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3651;&#3609;&#3600;&#3634;&#3609;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3586;&#3657;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604; &#3650;&#3611;&#3619;&#3604;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3623;&#3656;&#3634;&#3652;&#3604;&#3648;&#3619;&#3588;&#3607;&#3629;&#3619;&#3637;&#3648;&#3595;&#3629;&#3619;&#3660;&#3623;&#3636;&#3626;&#3607;&#3635;&#3591;&#3634;&#3609;&#3629;&#3618;&#3641;&#3656;</Message>
  <Message MsgTag="ErrSecureTokenInsecureResource">&#3585;&#3634;&#3619;&#3611;&#3657;&#3629;&#3591;&#3585;&#3633;&#3609;&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3605;&#3657;&#3629;&#3591;&#3617;&#3637;&#3585;&#3634;&#3619;&#3648;&#3594;&#3639;&#3656;&#3629;&#3617;&#3605;&#3656;&#3629;&#3607;&#3637;&#3656;&#3619;&#3633;&#3585;&#3625;&#3634;&#3588;&#3623;&#3634;&#3617;&#3611;&#3621;&#3629;&#3604;&#3616;&#3633;&#3618; &#3650;&#3611;&#3619;&#3604;&#3621;&#3629;&#3591;&#3648;&#3586;&#3657;&#3634;&#3651;&#3594;&#3657;&#3604;&#3657;&#3623;&#3618;&#3650;&#3611;&#3619;&#3650;&#3605;&#3588;&#3629;&#3621; 'https://' &#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3619;&#3632;&#3610;&#3610; Access Manager &#3627;&#3634;&#3585;&#3611;&#3633;&#3597;&#3627;&#3634;&#3618;&#3633;&#3591;&#3588;&#3591;&#3629;&#3618;&#3641;&#3656;</Message>
  <Message MsgTag="ErrUnexpected">&#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3611;&#3619;&#3632;&#3617;&#3623;&#3621;&#3612;&#3621;&#3588;&#3635;&#3586;&#3629; &#3648;&#3609;&#3639;&#3656;&#3629;&#3591;&#3592;&#3634;&#3585;&#3648;&#3585;&#3636;&#3604;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3607;&#3637;&#3656;&#3652;&#3617;&#3656;&#3588;&#3634;&#3604;&#3627;&#3617;&#3634;&#3618;</Message>
  <Message MsgTag="ErrUnknownCode">Access Server &#3649;&#3626;&#3604;&#3591;&#3612;&#3621;&#3621;&#3633;&#3614;&#3608;&#3660;&#3648;&#3611;&#3655;&#3609;&#3626;&#3606;&#3634;&#3609;&#3632;&#3607;&#3637;&#3656; WebGate &#3652;&#3617;&#3656;&#3619;&#3641;&#3657;&#3592;&#3633;&#3585;</Message>
  <Message MsgTag="ErrUrlLookupFailed">&#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3649;&#3617;&#3611; URL &#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3585;&#3633;&#3610;&#3650;&#3604;&#3648;&#3617;&#3609;&#3586;&#3629;&#3591;&#3586;&#3657;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604;&#3651;&#3609;&#3600;&#3634;&#3609;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3586;&#3657;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604; &#3650;&#3611;&#3619;&#3604;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3623;&#3656;&#3634;&#3652;&#3604;&#3648;&#3619;&#3588;&#3607;&#3629;&#3619;&#3637;&#3648;&#3595;&#3629;&#3619;&#3660;&#3623;&#3636;&#3626;&#3607;&#3635;&#3591;&#3634;&#3609;&#3629;&#3618;&#3641;&#3656;</Message>
  <Message MsgTag="ErrUserLockedOut">&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3607;&#3637;&#3656;&#3617;&#3637;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3606;&#3641;&#3585;&#3621;&#3655;&#3629;&#3588;&#3652;&#3617;&#3656;&#3651;&#3627;&#3657;&#3648;&#3586;&#3657;&#3634;&#3626;&#3641;&#3656;&#3619;&#3632;&#3610;&#3610; &#3648;&#3609;&#3639;&#3656;&#3629;&#3591;&#3592;&#3634;&#3585;&#3617;&#3637;&#3585;&#3634;&#3619;&#3614;&#3618;&#3634;&#3618;&#3634;&#3617;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609;&#3648;&#3585;&#3636;&#3609;&#3592;&#3635;&#3609;&#3623;&#3609;&#3588;&#3619;&#3633;&#3657;&#3591;&#3607;&#3637;&#3656;&#3585;&#3635;&#3627;&#3609;&#3604;</Message>
  <Message MsgTag="ErrUserRevoked">&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3651;&#3609;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609;&#3606;&#3641;&#3585;&#3618;&#3585;&#3648;&#3621;&#3636;&#3585; &#3650;&#3604;&#3618;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3619;&#3632;&#3610;&#3610;&#3586;&#3629;&#3591; Access System</Message>
  <Message MsgTag="ErrWRORAuthentLookupFailed">&#3652;&#3617;&#3656;&#3614;&#3610;&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3585;&#3598;&#3586;&#3629;&#3591;&#3586;&#3657;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3585;&#3633;&#3610; URL &#3649;&#3621;&#3632;&#3585;&#3634;&#3619;&#3607;&#3635;&#3591;&#3634;&#3609;&#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3651;&#3609;&#3600;&#3634;&#3609;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3586;&#3657;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604; &#3650;&#3611;&#3619;&#3604;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3623;&#3656;&#3634;&#3652;&#3604;&#3648;&#3619;&#3588;&#3607;&#3629;&#3619;&#3637;&#3648;&#3595;&#3629;&#3619;&#3660;&#3623;&#3636;&#3626;&#3607;&#3635;&#3591;&#3634;&#3609;&#3629;&#3618;&#3641;&#3656;</Message>
  <Message MsgTag="ErrWRORLookupFailed">&#3652;&#3617;&#3656;&#3614;&#3610;&#3585;&#3598;&#3586;&#3629;&#3591;&#3586;&#3657;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3585;&#3633;&#3610; URL &#3649;&#3621;&#3632;&#3585;&#3634;&#3619;&#3607;&#3635;&#3591;&#3634;&#3609;&#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3651;&#3609;&#3600;&#3634;&#3609;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3586;&#3657;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604; &#3650;&#3611;&#3619;&#3604;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3623;&#3656;&#3634;&#3652;&#3604;&#3648;&#3619;&#3588;&#3607;&#3629;&#3619;&#3637;&#3648;&#3595;&#3629;&#3619;&#3660;&#3623;&#3636;&#3626;&#3607;&#3635;&#3591;&#3634;&#3609;&#3629;&#3618;&#3641;&#3656;</Message>
  <Message MsgTag="ErrWrongPassword">&#3619;&#3632;&#3610;&#3640;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;</Message>
  <Message MsgTag="ErrWrongPreferredHost">&#3617;&#3637;&#3648;&#3614;&#3637;&#3618;&#3591; WebGate &#3607;&#3637;&#3656;&#3651;&#3594;&#3657; Apache &#3648;&#3607;&#3656;&#3634;&#3609;&#3633;&#3657;&#3609;&#3607;&#3637;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3594;&#3657; SERVER_NAME &#3648;&#3611;&#3655;&#3609;&#3650;&#3630;&#3626;&#3605;&#3660;&#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;</Message>
  <Message MsgTag="ErrWrongPreferredHostForApache">WebGate &#3607;&#3637;&#3656;&#3651;&#3594;&#3657; Apache &#3605;&#3657;&#3629;&#3591;&#3651;&#3594;&#3657; SERVER_NAME &#3648;&#3611;&#3655;&#3609;&#3650;&#3630;&#3626;&#3605;&#3660;&#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619; &#3648;&#3614;&#3639;&#3656;&#3629;&#3651;&#3594;&#3657;&#3591;&#3634;&#3609;&#3650;&#3630;&#3626;&#3605;&#3660;&#3649;&#3610;&#3610;&#3648;&#3623;&#3629;&#3619;&#3660;&#3594;&#3623;&#3621;</Message>
  <Message MsgTag="ExBadMode">&#3650;&#3627;&#3617;&#3604;&#3651;&#3609;&#3585;&#3634;&#3619;&#3648;&#3619;&#3637;&#3618;&#3585;&#3648;&#3617;&#3607;&#3608;&#3629;&#3604;&#3586;&#3629;&#3591; WebGate &#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;</Message>
  <Message MsgTag="ExLangInit">&#3585;&#3634;&#3619;&#3648;&#3619;&#3636;&#3656;&#3617;&#3605;&#3657;&#3609;&#3616;&#3634;&#3625;&#3634;&#3621;&#3657;&#3617;&#3648;&#3627;&#3621;&#3623;&#3651;&#3609;&#3648;&#3617;&#3607;&#3608;&#3629;&#3604;&#3586;&#3629;&#3591; WebGate</Message>
  <Message MsgTag="ExLoadSharedObj">&#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3650;&#3627;&#3621;&#3604;&#3629;&#3629;&#3610;&#3648;&#3592;&#3585;&#3605;&#3660;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3619;&#3656;&#3623;&#3617;&#3585;&#3633;&#3609;&#3651;&#3609;&#3648;&#3617;&#3607;&#3608;&#3629;&#3604;&#3586;&#3629;&#3591; WebGate</Message>
  <Message MsgTag="ExRethrowMsg">&#3617;&#3637;&#3585;&#3634;&#3619;&#3649;&#3626;&#3604;&#3591;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3595;&#3657;&#3635;&#3592;&#3634;&#3585;&#3648;&#3617;&#3607;&#3608;&#3629;&#3604;&#3586;&#3629;&#3591; WebGate</Message>
  <Message MsgTag="ExRethrowMsg1">&#3617;&#3637;&#3585;&#3634;&#3619;&#3649;&#3626;&#3604;&#3591;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3595;&#3657;&#3635;&#3592;&#3634;&#3585;&#3648;&#3617;&#3607;&#3608;&#3629;&#3604;&#3586;&#3629;&#3591; WebGate</Message>
  <Message MsgTag="ExRethrowMsg2">&#3617;&#3637;&#3585;&#3634;&#3619;&#3649;&#3626;&#3604;&#3591;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3595;&#3657;&#3635;&#3592;&#3634;&#3585;&#3648;&#3617;&#3607;&#3608;&#3629;&#3604;&#3586;&#3629;&#3591; WebGate</Message>
  <Message MsgTag="ExSymbolLookup">&#3585;&#3634;&#3619;&#3588;&#3657;&#3609;&#3627;&#3634;&#3626;&#3633;&#3597;&#3621;&#3633;&#3585;&#3625;&#3603;&#3660;&#3621;&#3657;&#3617;&#3648;&#3627;&#3621;&#3623;&#3651;&#3609;&#3648;&#3617;&#3607;&#3608;&#3629;&#3604;&#3586;&#3629;&#3591; WebGate</Message>
  <Message MsgTag="ExSyncCaches">&#3648;&#3585;&#3636;&#3604;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3586;&#3603;&#3632;&#3595;&#3636;&#3591;&#3650;&#3588;&#3619;&#3652;&#3609;&#3595;&#3660;&#3649;&#3588;&#3594;: %1</Message>
  <Message MsgTag="HTMLpage400">&lt;html>&lt;head>&lt;title>&#3588;&#3635;&#3586;&#3629;&#3586;&#3629;&#3591; Oracle Access Manager &#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;&lt;/title>&lt;META HTTP-EQUIV=&quot;Content-Type&quot; CONTENT=&quot;text/html; charset=utf-8&quot;>&lt;/head>&lt;body>&lt;h1>&#3588;&#3635;&#3586;&#3629;&#3586;&#3629;&#3591; Oracle Access Manager &#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;&lt;/h1>&lt;p>%1&lt;/p>&lt;/body>&lt;/html></Message>
  <Message MsgTag="HTMLpage500">&lt;html>&lt;head>&lt;title>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3651;&#3609;&#3585;&#3634;&#3619;&#3607;&#3635;&#3591;&#3634;&#3609;&#3586;&#3629;&#3591; Oracle Access Manager&lt;/title>&lt;META HTTP-EQUIV=&quot;Content-Type&quot; CONTENT=&quot;text/html; charset=utf-8&quot;>&lt;/head>&lt;body>&lt;h1>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3651;&#3609;&#3585;&#3634;&#3619;&#3607;&#3635;&#3591;&#3634;&#3609;&#3586;&#3629;&#3591; Oracle Access Manager&lt;/h1>&lt;p>%1&lt;/p>&lt;p>&#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3648;&#3623;&#3655;&#3610;&#3652;&#3595;&#3605;&#3660;&#3648;&#3614;&#3639;&#3656;&#3629;&#3649;&#3585;&#3657;&#3652;&#3586;&#3611;&#3633;&#3597;&#3627;&#3634;&#3609;&#3637;&#3657;&lt;/p>&lt;/body>&lt;/html></Message>
  <Message MsgTag="IISpage401">&lt;html>&lt;head>&lt;title>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604; 401.1&lt;/title>&lt;meta name=&quot;robots&quot; content=&quot;noindex&quot;>&lt;META HTTP-EQUIV=&quot;Content-Type&quot; CONTENT=&quot;text/html; charset=utf-8&quot;>&lt;/head>&lt;body>&lt;h2>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604; HTTP 401&lt;/h2>&lt;p>&lt;strong>401.1 &#3652;&#3617;&#3656;&#3617;&#3637;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;: &#3585;&#3634;&#3619;&#3621;&#3655;&#3629;&#3585;&#3629;&#3629;&#3609;&#3621;&#3657;&#3617;&#3648;&#3627;&#3621;&#3623;&lt;/strong>&lt;/p>&lt;p>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3609;&#3637;&#3657;&#3649;&#3626;&#3604;&#3591;&#3623;&#3656;&#3634;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3607;&#3637;&#3656;&#3619;&#3632;&#3610;&#3640;&#3651;&#3627;&#3657;&#3585;&#3633;&#3610;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660;&#3652;&#3617;&#3656;&#3605;&#3619;&#3591;&#3585;&#3633;&#3610;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3651;&#3609;&#3585;&#3634;&#3619;&#3621;&#3655;&#3629;&#3585;&#3629;&#3629;&#3609;&#3648;&#3586;&#3657;&#3634;&#3626;&#3641;&#3656;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660;&lt;/p>&lt;p>&#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3619;&#3632;&#3610;&#3610;&#3586;&#3629;&#3591;&#3648;&#3623;&#3655;&#3610;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660; &#3648;&#3614;&#3639;&#3656;&#3629;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3623;&#3656;&#3634;&#3588;&#3640;&#3603;&#3617;&#3637;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3648;&#3586;&#3657;&#3634;&#3651;&#3594;&#3657;&#3607;&#3619;&#3633;&#3614;&#3618;&#3634;&#3585;&#3619;&#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&lt;/p>&lt;/body>&lt;/html></Message>
  <Message MsgTag="IISpage404">&lt;html>&lt;head>&lt;title>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604; 404&lt;/title>&lt;meta name=&quot;robots&quot; content=&quot;noindex&quot;>&lt;META HTTP-EQUIV=&quot;Content-Type&quot; CONTENT=&quot;text/html; charset=utf-8&quot;>&lt;/head>&lt;body>&lt;h2>&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604; HTTP 404&lt;/h2>&lt;p>&lt;strong>404 &#3652;&#3617;&#3656;&#3614;&#3610;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&lt;/strong>&lt;/p>&lt;p>&#3648;&#3623;&#3655;&#3610;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660;&#3652;&#3617;&#3656;&#3614;&#3610;&#3652;&#3615;&#3621;&#3660;&#3627;&#3619;&#3639;&#3629;&#3626;&#3588;&#3619;&#3636;&#3611;&#3605;&#3660;&#3607;&#3637;&#3656;&#3588;&#3640;&#3603;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619; &#3650;&#3611;&#3619;&#3604;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610; URL &#3623;&#3656;&#3634;&#3614;&#3634;&#3608;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;&lt;/p>&lt;p>&#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3619;&#3632;&#3610;&#3610;&#3586;&#3629;&#3591;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660; &#3627;&#3634;&#3585;&#3611;&#3633;&#3597;&#3627;&#3634;&#3609;&#3637;&#3657;&#3652;&#3617;&#3656;&#3652;&#3604;&#3657;&#3619;&#3633;&#3610;&#3585;&#3634;&#3619;&#3649;&#3585;&#3657;&#3652;&#3586;&lt;/p>&lt;/body>&lt;/html></Message>
  <Message MsgTag="InvalidSelectionFilter">&#3626;&#3588;&#3637;&#3617;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; %1 &#3617;&#3637;&#3615;&#3636;&#3621;&#3648;&#3605;&#3629;&#3619;&#3660;&#3585;&#3634;&#3619;&#3648;&#3621;&#3639;&#3629;&#3585;&#3607;&#3637;&#3656;&#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;&#3651;&#3609;&#3611;&#3621;&#3633;&#3658;&#3585;&#3629;&#3636;&#3609;&#3586;&#3629;&#3591;&#3615;&#3636;&#3621;&#3648;&#3605;&#3629;&#3619;&#3660;&#3585;&#3634;&#3619;&#3648;&#3621;&#3639;&#3629;&#3585;</Message>
  <Message MsgTag="OAM-1">&#3617;&#3637;&#3585;&#3634;&#3619;&#3619;&#3632;&#3610;&#3640;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3627;&#3619;&#3639;&#3629;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3607;&#3637;&#3656;&#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;</Message>
  <Message MsgTag="OAM-10">&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3627;&#3617;&#3604;&#3629;&#3634;&#3618;&#3640; &#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3619;&#3632;&#3610;&#3610;</Message>
  <Message MsgTag="OAM-2">&#3617;&#3637;&#3585;&#3634;&#3619;&#3619;&#3632;&#3610;&#3640;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3627;&#3619;&#3639;&#3629;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609;&#3607;&#3637;&#3656;&#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;</Message>
  <Message MsgTag="OAM-3">&#3648;&#3585;&#3636;&#3604;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3607;&#3637;&#3656;&#3652;&#3617;&#3656;&#3588;&#3634;&#3604;&#3627;&#3617;&#3634;&#3618;&#3586;&#3603;&#3632;&#3611;&#3619;&#3632;&#3617;&#3623;&#3621;&#3612;&#3621;&#3594;&#3639;&#3656;&#3629;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3649;&#3621;&#3632;&#3619;&#3627;&#3633;&#3626;&#3612;&#3656;&#3634;&#3609; &#3650;&#3611;&#3619;&#3604;&#3621;&#3629;&#3591;&#3604;&#3635;&#3648;&#3609;&#3636;&#3609;&#3585;&#3634;&#3619;&#3651;&#3627;&#3617;&#3656;&#3629;&#3637;&#3585;&#3588;&#3619;&#3633;&#3657;&#3591;</Message>
  <Message MsgTag="OAM-4">&#3648;&#3585;&#3636;&#3604;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3586;&#3629;&#3591;&#3619;&#3632;&#3610;&#3610; &#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3619;&#3632;&#3610;&#3610;</Message>
  <Message MsgTag="OAM-5">&#3649;&#3629;&#3588;&#3648;&#3588;&#3634;&#3607;&#3660;&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3606;&#3641;&#3585;&#3621;&#3655;&#3629;&#3588;&#3627;&#3619;&#3639;&#3629;&#3648;&#3621;&#3636;&#3585;&#3651;&#3594;&#3657;&#3591;&#3634;&#3609; &#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3619;&#3632;&#3610;&#3610;</Message>
  <Message MsgTag="OAM-6">&#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3617;&#3637;&#3648;&#3595;&#3626;&#3594;&#3633;&#3609;&#3606;&#3638;&#3591;&#3592;&#3635;&#3609;&#3623;&#3609;&#3626;&#3641;&#3591;&#3626;&#3640;&#3604;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3652;&#3604;&#3657;&#3649;&#3621;&#3657;&#3623; &#3650;&#3611;&#3619;&#3604;&#3611;&#3636;&#3604;&#3648;&#3595;&#3626;&#3594;&#3633;&#3609;&#3607;&#3637;&#3656;&#3617;&#3637;&#3629;&#3618;&#3641;&#3656;&#3585;&#3656;&#3629;&#3609;&#3607;&#3637;&#3656;&#3592;&#3632;&#3614;&#3618;&#3634;&#3618;&#3634;&#3617;&#3621;&#3655;&#3629;&#3585;&#3629;&#3636;&#3609;&#3629;&#3637;&#3585;&#3588;&#3619;&#3633;&#3657;&#3591;</Message>
  <Message MsgTag="OAM-7">&#3648;&#3585;&#3636;&#3604;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3586;&#3629;&#3591;&#3619;&#3632;&#3610;&#3610; &#3650;&#3611;&#3619;&#3604;&#3621;&#3629;&#3591;&#3604;&#3635;&#3648;&#3609;&#3636;&#3609;&#3585;&#3634;&#3619;&#3629;&#3637;&#3585;&#3588;&#3619;&#3633;&#3657;&#3591; &#3606;&#3657;&#3634;&#3588;&#3640;&#3603;&#3618;&#3633;&#3591;&#3614;&#3610;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3609;&#3637;&#3657;&#3629;&#3618;&#3641;&#3656; &#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3619;&#3632;&#3610;&#3610;</Message>
  <Message MsgTag="OAM-8">&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660;&#3621;&#3657;&#3617;&#3648;&#3627;&#3621;&#3623;</Message>
  <Message MsgTag="OAM-9">&#3648;&#3585;&#3636;&#3604;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3586;&#3629;&#3591;&#3619;&#3632;&#3610;&#3610; &#3650;&#3611;&#3619;&#3604;&#3621;&#3629;&#3591;&#3604;&#3635;&#3648;&#3609;&#3636;&#3609;&#3585;&#3634;&#3619;&#3629;&#3637;&#3585;&#3588;&#3619;&#3633;&#3657;&#3591; &#3606;&#3657;&#3634;&#3588;&#3640;&#3603;&#3618;&#3633;&#3591;&#3614;&#3610;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3609;&#3637;&#3657;&#3629;&#3618;&#3641;&#3656; &#3650;&#3611;&#3619;&#3604;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3612;&#3641;&#3657;&#3604;&#3641;&#3649;&#3621;&#3619;&#3632;&#3610;&#3610;</Message>
</MessageCtlg>