<?xml version="1.0" encoding="US-ASCII"?>
<!--
 |  Oracle Deutschland GmbH
 |
 |  This software is the confidential and proprietary information of
 |  Oracle Corporation. ("Confidential Information").  You shall not
 |  disclose such Confidential Information and shall use it only in
 |  accordance with the terms of the license agreement you entered
 |  into with Oracle.
 |
 |  ORACLE MAKES NO REPRESENTATIONS OR WARRANTIES ABOUT THE SUITABILITY OF THE
 |  SOFTWARE, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE
 |  IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
 |  PURPOSE, OR NON-INFRINGEMENT. ORACLE SHALL NOT BE LIABLE FOR ANY DAMAGES
 |  SUFFERED BY LICENSEE AS A RESULT OF USING, MODIFYING OR DISTRIBUTING
 |  THIS SOFTWARE OR ITS DERIVATIVES.
 |
 |  Copyright &#169; 2021. All Rights reserved
-->
<chapter xmlns   ="http://docbook.org/ns/docbook"
         xmlns:xl="http://www.w3.org/1999/xlink"
         xmlns:xi="http://www.w3.org/2001/XInclude"
         xml:id  ="about"
         xml:lang="de"
         version ="5.0">
  <title>Einf&#252;hrung zur Access Manager OIDC-Erweiterung</title>
  <para>
    Oracle&#174; Access Management ist eine Komplettl&#246;sung, die eine sichere Gesch&#228;ftstransformation mit Mobil- und Social-Networking-Technologien, der Bereitstellung hybrider Anwendungen vor Ort und in der Cloud sowie einer hybriden Bereitstellung von Zugriffsverwaltung erm&#246;glicht und gleichzeitig ein nahtloses Benutzererlebnis, eine zentralisierte Verwaltung sowie marktf&#252;hrende Leistung und Skalierbarkeit gew&#228;hrleistet.
  </para>
  <para>
    Die folgenden Abschnitte geben einen allgemeinen &#220;berblick &#252;ber die Erweiterung:
  </para>
  <itemizedlist>
    <listitem>
      <link linkend="about-cmp">Erforderliche Komponenten</link>
      <para/>
    </listitem>
    <listitem>
      <link linkend="about-use">Anwendungsempfehlung</link>
      <para/>
    </listitem>
    <listitem>
      <link linkend="about-nls">Unterst&#252;tzte Sprachen</link>
      <para/>
    </listitem>
  </itemizedlist>
  <section xml:id="about-cmp">
    <title>Erforderliche Komponenten</title>
    <para>
      Die in diesem Dokument aufgef&#252;hrten plattformspezifischen Hardware- und Softwareanforderungen sind zum Zeitpunkt der Erstellung dieses Dokuments g&#252;ltig.
      Da nach der Ver&#246;ffentlichung dieses Dokuments m&#246;glicherweise neue Plattformen und Betriebssysteme zertifiziert werden, wird empfohlen, die Zertifizierungsmatrix im Oracle Technology Network zu konsultieren.
      Die aktuellen Aussagen zu zertifizierten Plattformen und Betriebssystemen finden Sie dort.
    </para>
    <para>
      Die entsprechende Zertifizierungsmatrix f&#252;r Produkte der Oracle Identity and Access Management Suite ist unter den folgenden URLs verf&#252;gbar:
    </para>
    <itemizedlist mark="bullet">
      <listitem>
        <link xl:show="new" xl:href="ttps://www.oracle.com/docs/tech/middleware/fmw-122140-certmatrix.xlsx" xl:role="http://docbook.org/xlink/role/olink">
          <citetitle>Oracle&#174; Fusion Middleware 12c (12.2.1.4.0)</citetitle>
        </link>
      <para/>
      </listitem>
      <listitem>
        <link xl:show="new" xl:href="https://www.oracle.com/technetwork/middleware/fmw-122130-certmatrix-3867828.xlsx" xl:role="http://docbook.org/xlink/role/olink">
          <citetitle>Oracle&#174; Fusion Middleware 12c (12.2.1.3.0)</citetitle>
        </link>
      </listitem>
    </itemizedlist>
    <section xml:id="about-cmp-req">
      <title>Erforderliche Versionen</title>
      <para>
        Dies sind die Softwarekomponenten und Versionen, die zur Installation und den Einsatz der Erweiterung erforderlich sind.
      </para>
      <table colsep="0">
        <tgroup cols="2">
          <colspec colname="c1" colwidth="15em"/>
          <colspec colname="c2" colwidth="*"/>
          <thead>
            <row>
              <entry>Komponente</entry>
              <entry>Version</entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry>Oracle&#174; Java Development Kit</entry>
              <entry>JDK 1.8.0_131 oder h&#246;her</entry>
            </row>
            <row>
              <entry>Oracle&#174; Infrastruktur</entry>
              <entry>Oracle&#174; WebLogic 12c (12.2.1.4.0)</entry>
            </row>
            <row>
              <entry>Oracle&#174; Database</entry>
              <entry>Oracle&#174; RDBMS 12c (12.2.0.1.0) oder h&#246;her</entry>
            </row>
            <row>
              <entry>Oracle&#174; Access Management</entry>
              <entry>Oracle&#174; Access Management 12c Release 12.2.1.4.0</entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </section>
    <section xml:id="about-cmp-upg">
      <title>Erforderliche Patches</title>
      <para>
         Dies sind die Softwarekomponenten und Versionen, die zur Installation und den Einsatz der Erweiterung erforderlich sind.
      </para>
      <table colsep="0">
        <tgroup cols="2">
          <colspec colname="c1" colwidth="15em"/>
          <colspec colname="c2" colwidth="*"/>
          <thead>
            <row>
              <entry>Komponente</entry>
              <entry>Version</entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry>Oracle&#174; Access Management</entry>
              <entry>Oracle&#174; Fusion Middleware Bundle Patch 12.2.1.4.240415</entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </section>
  </section>
  <section xml:id="about-use">
    <title>Anwendungsempfehlung</title>
    <para>
      Single-Sign-On-Systeme (SSO) erm&#246;glichen es Benutzern, sich einmal zu authentifizieren und danach auf mehrere verschiedene Systeme zuzugreifen.
      Es gibt viele SSO-Systeme f&#252;r Webanwendungen, es sieht jedoch so aus, als ob diese Systeme alle das gleiche grundlegende Funktionsprinzip verwenden.
      Dieser allgemeine Ablauf der Zugriffsverwaltung wird im Folgenden beschrieben:
    </para>
    <figure xml:id="about-use-fig">
      <title>Access Manager im Kontext Single Sign On</title>
      <mediaobject>
        <alt>SSO Kontext</alt>
        <imageobject>
          <!--
           | The location of the image path must be relative to xml:base set
           | at the enclosing book element
           -->
         <imagedata scalefit="1" width="100%" contentdepth="100%" fileref="src/site/images/de/sso-principles.png" format="PNG"/>
       </imageobject>
      </mediaobject>
    </figure>
    <orderedlist continuation="restart">
      <listitem>
        <para>
          Ein Benutzer fordert Zugriff auf Anwendung 1 an worauf diese pr&#252;ft, ob eine lokale Sitzung f&#252;r den Benutzer existiert
          Ist diese nicht vorhanden leitet die Anwendung den Benutzer zum Dienst Access Server der Zugriffssteuerung weiter.
        </para>
        <para/>
      </listitem>
      <listitem>
        <para>
          Der Access Server der Zugriffssteuerung pr&#252;ft, ob eine SSO-Sitzung vorhanden ist.
          Da noch keine Sitzung besteht, fordert der Access Server der Zugriffskontrolle den Benutzer zur Authentifizierung auf.
        </para>
        <para/>
      </listitem>
      <listitem>
        <para>
          Nach Bereitstellung der Daten f&#252;r die Authentifizierung werden diese unter Verwendung eines externen Dienst vorgenommen.
          Im einfachsten Fall ist das ein Verzeichnisdienst, im komplexeren Umgebungen werden auch externe Identity Provider (IdP) hinzugezogen.
          Die Zugriffssteuerung richtet bei erfolgreicher Authentifizierung eine Sitzung (SSO-Sitzung) f&#252;r den Webbrowser des Benutzers ein.
          Dies ist der entscheidende Teil des SSO-Mechanismus.
        </para>
        <para/>
      </listitem>
      <listitem>
        <para>
          Der Benutzer wird zur&#252;ck zu Anwendung 1 umgeleitet und die Anwendung erstellt normalerweise ihrerseits eine lokale Sitzung f&#252;r den Benutzer.
        </para>
        <para/>
      </listitem>
      <listitem>
        <para>
          Der Benutzer interagiert mit Anwendung 1.
        </para>
        <para/>
      </listitem>
      <listitem>
        <para>
          Wenn der Benutzer versucht, auf Anwendung 2 zuzugreifen, pr&#252;ft diese ebenso wie Anwendung 1 zun&#228;chst auf die Existenz einen lokalen Sitzung f&#252;r den benutzer.
          Ist diese nicht vorhanden leitet die Anwendung den Benutzer wie Anwendung 1 an den Access Server der Zugriffssteuerung weiter.
        </para>
        <para/>
      </listitem>
      <listitem>
        <para>
          Die Zugriffssteuerung pr&#252;ft erneut, ob eine SSO-Sitzung vorhanden ist.
          Da sich der Benutzer zuvor am Access Server der Zugriffssteuerung authentifiziert hat, liegt eine g&#252;ltige SSO-Sitzung vor.
        </para>
        <para/>
      </listitem>
      <listitem>
        <para>
          Die Zugriffssteuerung muss den Benutzer nicht erneut authentifizieren und leitet den Benutzer sofort zur&#252;ck zu Anwendung 2.
        </para>
        <para/>
      </listitem>
      <listitem>
        <para>
          Anwendung 2 richtet ihrerseits eine lokale Sitzung mit dem Benutzer ein und f&#228;hrt normal fort.
        </para>
        <para/>
      </listitem>
    </orderedlist>
  </section>
  <section xml:id="about-nls">
    <title>Unterst&#252;tzte Sprachen</title>
    <para>
      Die Erweiterung unterst&#252;tzt die folgenden Sprachen:
    </para>
    <itemizedlist>
      <listitem>
        <para>English</para>
        <para/>
      </listitem>
    </itemizedlist>
  </section>
</chapter>